openfoam/OpenFOAM-dev/tutorials/multiRegion/CHT/VoFcoolingCylinder2D/constant/solid/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType          constSolidThermo;

rho
{
    type        uniform;
    value       2000;
}

Cv
{
    type        uniform;
    value       100;
}

kappa
{
    type        uniform;
    value       1;
}


// ************************************************************************* //
